In [1]:
import pandas as pd

In [3]:
people = {
    'first': ['Corey', 'Jane', 'John'],
    'last': ['Schafer','Doe','Doe'],
    'email': ['corey@gmail.com', 'jane@gmail.com','john@gmail.com']
}

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first     last            email
0  Corey  Schafer  corey@gmail.com
1   Jane      Doe   jane@gmail.com
2   John      Doe   john@gmail.com

In [6]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

## Updating the columns

### Renaming all of the columns
We can do this simply by assignment. <br>
That is, passing new column values as a list.
<br><br>
Syntax:<br>
df.columns = ['newcol1', 'newcol2'....'newcoln']

In [9]:
#changing the columns by assignment
df.columns = ['first name', 'last name', 'email']
df.columns

Index(['first name', 'last name', 'email'], dtype='object')

In [10]:
df

  first name last name            email
0      Corey   Schafer  corey@gmail.com
1       Jane       Doe   jane@gmail.com
2       John       Doe   john@gmail.com

## Making changes to all the column names

Example:<br>
Setting all the column names to Upper case<br>
Replacing spaces with underscorees <br>
Setting all the column names to Title<br>

<br><br>
<b><i>We can accomplish this by list comprehension</i></b>

In [11]:
#Setting all the column names to upper case
df.columns = [x.upper() for x in df.columns]
df

  FIRST NAME LAST NAME            EMAIL
0      Corey   Schafer  corey@gmail.com
1       Jane       Doe   jane@gmail.com
2       John       Doe   john@gmail.com

In [14]:
#Replacing spaces with underscores
df.columns = df.columns.str.replace(' ','_')
df

  FIRST_NAME LAST_NAME            EMAIL
0      Corey   Schafer  corey@gmail.com
1       Jane       Doe   jane@gmail.com
2       John       Doe   john@gmail.com

## Renaming only specific column(s)
We can accomplish this by using the rename() method <br><br>

Note: By default, this method is not inplace, so we have to explicitly specify <br>
inplace = True

Syntax:<br>
df.rename(columns = {'oldcol1':'newcol1', 'oldcol2':'newcol2'}, inplace = True)

In [16]:
df.rename(columns = {'FIRST_NAME': 'first', 'LAST_NAME': 'last'}, inplace = True)
df

   first     last            EMAIL
0  Corey  Schafer  corey@gmail.com
1   Jane      Doe   jane@gmail.com
2   John      Doe   john@gmail.com